[{"Name": "ARCHITECURAL GRAPHICS AND COMMUNICATION", "Subject": "AREN", "Number": 3002.0, "Description": "With this course, students develop an understanding of the architectural design process and the graphic means for communicating and exchanging design content during the execution of a building project. The course covers the following topics: Nature of design (problems, solutions and process), building siting and orientation aimed at reducing energy requirements, architectural drawings (plans, elevations and cross sections), isometric projections and detail drawings. Most of these topics build upon the systematic use of electronic modeling software. This course is lab oriented.", "SDGs": [3, 7, 11], "IsEstimate": 1.0}, {"Name": "ECOLOGY, ENVIRONMENT, AND ANIMAL BEHAVIOR", "Subject": "BB", "Number": 2904.0, "Description": "This course examines topics in ecology and animal behavior through hands on experimentation and simulation. Activities in this course include interactions and observation of live animals as well as some outdoor activities and environmental sampling. This course will be relevant to students who have an interest in biology at more than the individual organism level as well as those with majors involving environmental and ecological concerns. Examples of the specific types of techniques and experience included in this course are: ? Observing, recording, understanding, and analyzing animal behaviors ? Handling of organisms ? Environmental and ecological assessment and sampling ? Observations of population dynamics", "SDGs": [1, 15], "IsEstimate": 0.0}, {"Name": "HUMANITARIAN ENGINEERING: PAST AND PRESENT", "Subject": "ES", "Number": "200X", "Description": "This course will focus on understanding the engineering and humanitarian challenges connected to designing a sanitation system in the developing world or in an under-resourced part of the developed world. Students will study social and stakeholder considerations as well as treatment and transport, which will inform the design of a prototype system using appropriate locally available resources. This is a project-based, hands-on research and solution-based course in which students will be divided into teams of 3 or 4 persons each. Each team will have weekly objectives/assignments that will be presented to the whole class via oral presentations. Discussion, criticism, suggestions, etc. will follow each team's in-class presentation. The purpose of these peer evaluations is to drive the development of the final physical model of the solution, and the building of the final poster for presentation.", "SDGs": [1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 13, 15], "IsEstimate": 0.0}, {"Name": "GLOBAL ENVIRONMENTAL POLITICS", "Subject": "GOV", "Number": 2319.0, "Description": "It is apparent that environmental problems have outgrown national policy frameworks. Thus, institutions have emerged at the international and transnational levels to coordinate collective problem solving. But governance involves more than just the practicality of problem solving; it also involves uncertainty, controversy, power and politics. This course will examine the ways in which global environmental governance has been conceived: from establishing international institutions and agreements, to less tangible ways of interacting. We will examine themes such as scales of governance (from the United Nations to communities), policy networks, the role of NGOs, think tanks and special interests and the role of knowledge in global environmental debates. Students will then use this conceptual and theoretical basis to analyze major global environmental issues including: deforestation; biodiversity; endangered species; and climate change. The goals of this course are to gain an understanding of the main positions in global environmental debates; critically analyze these positions; and gain insight into the politics of global environmental policy and governance.", "SDGs": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], "IsEstimate": 0.0}, {"Name": "PHILOSOPHY AND THE ENVIRONMENT", "Subject": "PY", "Number": 2717.0, "Description": "This course will focus on the following questions: What is the scope of the current environmental crisis? What does this crisis reveal about the philosophical presuppositions and dominant values of our intellectual worldviews and social institutions? How can existing social theories help explain the environmental crisis? What implications does the crisis have for our sense of personal identity? What moral and spiritual resources can help us respond to it? Readings will be taken from contemporary and historical philosophers and naturalists.", "SDGs": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], "IsEstimate": 0.0}, {"Name": "SENIOR SEMINAR IN ENVIRONMENTAL STUDIES", "Subject": "ENV", "Number": 4400.0, "Description": "This course is intended for Environmental Studies majors. The course is designed to integrate each student's educational experience (e.g., core environmental courses, environmental electives, and environmental projects) in a capstone seminar in Environmental Studies. Through seminar discussions and writing assignments students will critically reflect on what they learned in their previous courses and project experiences. In teams, students will prepare a final capstone paper and presentation that critically engages their educational experience in environmental studies and anticipates how their courses and experiences will translate into their future personal and professional environmental experiences.", "SDGs": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], "IsEstimate": 0.0}, {"Name": "TOPICS IN PHILOSOPHY", "Subject": "PY", "Number": 3711.0, "Description": "The purpose of this course is to expose students to somewhat more advanced and specialized study in philosophy. Its focus will vary, but will typically be one of the following types: a particular philosopher (e.g., Plato, Kant, Mill); a particular philosophical tradition (e.g., Pragmatism, Ordinary Language philosophy, Empiricism); a particular philosophical problem (free will, knowledge of other minds, historical explanation); or a particular philosophical classic (Hegel's Phenomenology of Mind, Aristotle's Ethics). The topical theme of the class will be provided as a modified course title in the course description posted online.", "SDGs": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], "IsEstimate": 0.0}, {"Name": "DEVELOPMENT ECONOMICS", "Subject": "ECON", "Number": 1110.0, "Description": "This course is a general introduction to the field of development economics. The focus is on ways in which a developing country can increase its productive capacity, both agricultural and industrial, in order to achieve sustained economic growth. The course proceeds by first examining how economic growth and economic development are measured and how the various nations of the world compare according to well-known social and economic indicators. Theories of economic growth and theories of economic development are then examined, as are the various social and cultural structures that are thought to influence economic progress. The inputs to economic growth and development (land, labor, capital, entrepreneurial ability, education, technical change), and the possible distributions of income and levels of employment that result from their use, is considered next. Domestic economic problems and policies such as development planning, the choice of sectorial policies, the choice of monetary and fiscal policies, rapid population growth, and urbanization and urban economic development are then examined. The course concludes with a consideration of international problems and policies such as import substitution and export promotion, foreign debt, foreign investment, and the role of international firms. In conjunction with a traditional presentation of the above topics, the course curriculum will include the use of computer simulation models and games. These materials have been formulated with a simulation technique, system dynamics, that has its origins in control engineering and the theory of servomechanisms. As a result, students will find them complementary to their work in engineering and science. In addition, the various development theories and simulation and gaming results will be related, where possible, to specific developing nations where WPI has ongoing project activities (e.g., Costa Rica and Thailand). This course is recommended for those students wishing to do an IQP or MQP in a developing nation.", "SDGs": [1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13], "IsEstimate": 0.0}, {"Name": "PLANT DIVERSITY", "Subject": "BB", "Number": 2030.0, "Description": "This course focuses on general concepts as they relate to the vast array of plant species and their taxonomic links. Current uses of major plant phyla in both society and the biotechnology industry will be explored. Some emphasis will be given to economically important species chosen from agronomic and non-agronomic situations. Recommended background: a working knowledge of concepts in biodiversity (BB1045 or equivalent). Students may not receive credit for both BB 2030 and BB 1040 (no longer offered).", "SDGs": [2, 6, 13, 14, 15], "IsEstimate": 0.0}, {"Name": "WORK SYSTEMS AND FACILITIES PLANNING", "Subject": "OIE", "Number": 3405.0, "Description": "This course covers the fundamentals of developing efficient layouts for production and service facilities. Methods analysis, work measurement, material handling and material flow analysis are also covered. Mathematical models and computer tools are used to assist decision-making.", "SDGs": [3, 5, 9, 12], "IsEstimate": 0.0}, {"Name": "TRANSPORT & TRANSFORMATIONS IN THE ENVIRONMENT", "Subject": "CE", "Number": 4063.0, "Description": "In this course, students will learn to make quantitative relationships between human activities and the effects on water, soil, and air in the environment. Students will learn the scientific and engineering principles that are needed to understand how contaminants enter and move in the environment, how compounds react in the environment, how to predict their concentrations in the environment, and how to develop solutions to environmental problems. Topics to be covered may include water quality engineering (including microbial interactions), air quality engineering, and hazardous waste management.", "SDGs": [3, 6, 7, 9, 12, 13, 14, 15], "IsEstimate": 0.0}, {"Name": "ENVIRONMENTAL ENGINEERING LABORATORY", "Subject": "CE", "Number": 4060.0, "Description": "This course familiarizes students with the laboratory studies used to obtain the design parameters for water and wastewater treatment systems. The topics include laboratory experiments dealing with physical, chemical, and biological treatment systems.", "SDGs": [6, 14], "IsEstimate": 0.0}, {"Name": "HAZARDOUS AND INDUSTRIAL WASTE MANAGEMENT", "Subject": "CE", "Number": 4600.0, "Description": "This course will cover concepts and techniques for handling hazardous and industrial wastes. Regulations governing hazardous waste, water & soil remediation concepts, and the fundamentals of waste treatment processes will be discussed. Instruction will be provided through lectures, fieldtrips, practitioner seminars, and class problem solving sessions.", "SDGs": [6, 14, 15], "IsEstimate": 0.0}, {"Name": "CHEMICAL PLANT DESIGN PROJECT", "Subject": "CHE", "Number": 4404.0, "Description": "Cat. I Application of Chemical Engineering design principles to the design of a major chemical plant. Students work in groups to produce a preliminary practical process flowsheet, equipment and plant design, and economic analysis. Recommended background: familiarity with techniques and procedures emphasized in CHE 4403.", "SDGs": [6, 7, 8, 9, 11, 12, 13], "IsEstimate": 0.0}, {"Name": "TOPICS IN ASIAN HISTORY", "Subject": "HI", "Number": 3343.0, "Description": "This seminar course examines topics in the cultural, socio-economic, religious and political history of East Asia. Topics vary each year and may include the following: nationalism and the writing of history, travel and exploration narratives, cross-cultural contact, the role of religion and ideology in political history, development and the environment in Asia, film and history, and the place of minorities and women in Asian societies.", "SDGs": [6, 7, 9, 11], "IsEstimate": 0.0}, {"Name": "DESIGN AND OPTIMIZATION OF THERMAL SYSTEMS", "Subject": "ME", "Number": 4422.0, "Description": "This course introduces students to design of small and large scale optimal thermal systems. The hardware associated with thermal systems includes fans, pumps, compressors, engines, expanders, turbines, heat and mass exchangers, and reactors, all interconnected with some form of conduits. Generally, the working substances are fluids. These types of systems appear in such industries as power generation, electric and gas utilities, refrigeration and cryogenics, air conditioning and heating, food, chemical, petroleum, and other process industries. This course is intended for mechanical engineering students, especially those seeking a concentration in Thermal-Fluids. Additionally, this course might be of interest to students in Aerospace Engineering and Chemical Engineering.", "SDGs": [7, 11, 12], "IsEstimate": 0.0}, {"Name": "BUILDING PHYSICS", "Subject": "AREN", "Number": 3024.0, "Description": "The course introduces the principles of building physics, as they are applied to various building design situations and performance requirements. Covered topics include heat transfer, moisture control, condensation, cold bridging, external and internal gains, and air flows, as they pertain to building envelopes (external walls, windows and doors, and roofs) and the requirements of environmental comfort of space occupants. Design exercises take into account pertinent building and energy codes as well as comfort standards. The course gives students the tools to integrate engineering science fundamentals and physics principles in developing building design solutions. Thermal measurements in building components are performed.", "SDGs": [3, 7, 11], "IsEstimate": 1.0}, {"Name": "INTRODUCTION TO ARCHITECTURAL ENGINEERING SYSTEMS", "Subject": "AREN", "Number": 2023.0, "Description": "The objective of this course is to introduce the functional parts and systems that make up a building as well as their interactions in delivering required sustainable performance. It encompasses foundations, structures, building enclosures, heating and air conditioning, electrical, plumbing and fire safety systems as well as concepts of building performance and aspects of pertinent building codes and standards. This course, in addition, incorporates basic principles of building science and green construction.", "SDGs": [6, 11], "IsEstimate": 1.0}, {"Name": "PRINCIPLES OF HVAC DESIGN FOR BUILDINGS", "Subject": "AREN", "Number": 3003.0, "Description": "The course introduces principles and applications of mechanical systems that are required for environmental comfort, health, and safety of building occupants with a focus on energy efficiency and conservation. Topics include psychometrics, thermal comfort, building heating and cooling loads, fluid flow basics, HVAC components and systems, building envelop heat transfer, and energy requirements. In the course, students develop the ability to design and conduct computational modelling experiments and to analyze and interpret output data for selection between system alternatives in order to optimize energy use. ", "SDGs": [3, 7, 11], "IsEstimate": 1.0}, {"Name": "LIGHTING SYSTEMS", "Subject": "AREN", "Number": 2004.0, "Description": "This course focuses on the design of illumination systems in buildings. It provides a general introduction to the visual environment, including subjective and objective scales of measurement, visual perception, photometry, brightness, luminance, illumination, natural and artificial lighting. Other topics include photometric units, light sources, daylight luminaries, lighting quality, light loss factors, average luminance calculations (lumen method), point-by-point calculations, performance impacts, and ethics. Field measurements and computer simulations are used to explore some major aspects of architectural illumination systems. Design problems are solved by considering economic evaluation, energy saving criteria and applicable standards and building codes.", "SDGs": [3, 7, 8], "IsEstimate": 1.0}, {"Name": "ADVANCED HVAC SYSTEM DESIGN", "Subject": "AREN", "Number": 3006.0, "Description": "Analysis of heating and cooling load requirements, considering building construction type, geometry, infiltration, occupancy effects, and daily load variations. Heating design addresses water heating systems, electrical heating, central heating, heating of low and high-rise buildings, selection of heaters, boilers, pumps, piping design. Cooling design addresses refrigerants, refrigeration cycle, evaporator, compressor, condenser, thermostatic expansion valves, refrigeration system control equipment, motor and motor control equipment, refrigeration accessories, calculation of refrigeration piping and absorption systems. Computer applications for heating and cooling load analysis will be introduced to develop energy saving solutions. Analytical techniques and building codes are discussed through case studies and design projects.", "SDGs": [7, 11], "IsEstimate": 1.0}, {"Name": "BUILDING ENERGY SIMULATION", "Subject": "AREN", "Number": 3020.0, "Description": "The course addresses the basic principles of building energy simulation, with a focus on the practical applications of building energy simulation tools to building design. Topics being covered include various model input parameters such as building geometry, orientation, climate, comfort, zoning, material properties, operation schedules, and HVAC systems. Building energy simulation software packages are illustrated and applied to the analysis of various case studies of buildings. Simulation output results are critically analyzed and compared to the results obtained from other building energy calculation methods. ", "SDGs": [3, 7, 11], "IsEstimate": 1.0}, {"Name": "BUILDING ENVELOPE DESIGN", "Subject": "AREN", "Number": 3022.0, "Description": "The course presents the basic principles of building envelope design, focusing primarily on its functional performance requirements and practical constructability aspects. Various building envelope systems are discussed and analyzed through case studies. Lecture topics include facade and roofing systems made of masonry, stone, concrete, timber, glass, and various metals. In addition, more complex building envelope strategies such as double skin facades, passive solar design, and building automation approaches, are discussed. The course includes design exercises and a case study project. ", "SDGs": [3, 11], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL BIOLOGY", "Subject": "BB", "Number": 1002.0, "Description": "This course is designed for students seeking a broad overview of ecological systems and the effect of humans on the ecosystems. It provides an introduction to natural ecosystems, population growth, and the interaction between human populations and our environment. It is conducted in an active style including the use of case studies, class discussion/participation, and classroom polling systems. The major goal of this course is to help students become more informed environmental citizens, skeptical when presented with data in the media, and knowledgeable enough to question and make informed decisions about the environment. It will primarily focus on current topics but areas of discussion likely to be covered include ecosystems, populations, biodiversity, pollution, environmental economics and climate change.", "SDGs": [8, 9, 13, 14, 15], "IsEstimate": 1.0}, {"Name": "BIODIVERSITY", "Subject": "BB", "Number": 1045.0, "Description": "Through lectures, readings, and discussions this course will examine the breadth, patterns, mechanisms, and conservation of biodiversity. Case studies and peer-to-peer learning will be used to examine threats to regional and global biodiversity and assess management and engineering strategies for solutions to the biodiversity crisis. Students will investigate and interpret past and contemporary research to quantify, document, and track trends in biodiversity. This course will use problem sets and assignments to explore the natural, social, and economic tradeoffs associated with threats to and conservation of biodiversity. Students will develop an area of expertise and synthesize their comprehension of topics through project work (e.g., management plan, report, presentation, citizen science). Finally, this course will provide a synthesis of the interdisciplinary nature of biodiversity conservation and how principles of conservation biology, landscape ecology, metapopulation biology, and biogeography can be applied to strategies aimed towards sustaining Earth?s biota.", "SDGs": [1, 3, 8, 9, 11, 12, 13, 14, 15], "IsEstimate": 1.0}, {"Name": "PRINCIPLES OF ECOLOGY", "Subject": "BB", "Number": 2040.0, "Description": "This course is intended to help students understand ecological concepts at different levels of integration, from individuals to ecosystems, and the linkages among them. Students will also practice the application of qualitative and quantitative models to ecological systems and processes, as well as hypothesis generation, experimental design, and analysis and interpretation of data. In a format that includes team-based case studies, discussion and presentations, and ecological simulations, students will explore topics in both basic and applied ecology, which may include population ecology, host-parasite ecology and epidemiology, climate change, and sustainable agriculture, among others. ", "SDGs": [3, 12, 13, 14, 15], "IsEstimate": 1.0}, {"Name": "MQP CAPSTONE DESIGN", "Subject": "BME", "Number": 4300.0, "Description": "This course guides students through the engineering design process during the first term of their MQP to aid them in fulfilling their capstone design requirement. The course focuses on developing a revised client statement based on the objectives, constraints, and functions of the design. Methods for concept generation, concept selection and development strategy will be covered. In addition, project planning tools, business plans, ethics, and design for manufacturability and sustainability will be covered.", "SDGs": [4, 9, 12], "IsEstimate": 1.0}, {"Name": "GLOBAL ENVIRONMENT OF BUSINESS DECISIONS", "Subject": "BUS", "Number": 1020.0, "Description": "The global nature of business is indisputable. This course introduces the students to the complexity of the global environment and adopts a multi-dimensional view (cultural, economic, social, legal, political, and technological) of world economy. It promotes understanding the global environment as integrative forces affecting the success or failure of today’s businesses and fosters a global perspective. Topics may include an overview of the world economy, comparative advantage and international trade, cultural distance, FDI/ globalization theory, outsourcing and global supply chain coordination, political and country risk, the global monetary system and currency risk, legal and ethical issues, and risk management.", "SDGs": [1, 8, 12, 16, 17], "IsEstimate": 1.0}, {"Name": "CIVIL ENGINEERING AND COMPUTER FUNDAMENTALS", "Subject": "CE", "Number": 1030.0, "Description": "This course introduces students to basic fundamentals of civil engineering, group dynamics, oral presentation skills, engineering report writing techniques, and uses of the computer. Basics of structural engineering, geotechnical engineering, environmental engineering, surveying, materials, and construction engineering and management are presented in this course through a collaborative group teaching approach. Background is provided to gain competence in operating systems, editors, and spreadsheets. Student groups complete weekly computer laboratory projects and develop oral presentations and written reports.", "SDGs": [6, 7, 9, 11], "IsEstimate": 1.0}, {"Name": "TRANSPORTATION: TRAFFIC ENGINEERING", "Subject": "CE", "Number": 3050.0, "Description": "This course provides an introduction to the field of transportation engineering with particular emphasis on traffic engineering. Topics covered include a description of the transportation industry and transportation modes; characteristics of drivers, pedestrians, vehicles and the roadway; traffic engineering studies, highway safety, principles of traffic flow, intersection design and control, capacity analysis, and level of service analysis.", "SDGs": [3, 9, 11], "IsEstimate": 1.0}, {"Name": "LEGAL ASPECTS OF PROFESSIONAL PRACTICE", "Subject": "CE", "Number": 3022.0, "Description": "The course focuses on the legal underpinnings that regulate the design and execution of construction projects and the relations between their participants. The subject is presented according to the various phases of a construction project, from inception to handover. The overall objective is to develop an awareness of the legal aspects that regulate the exercise of the architectural and civil engineering profession and of the environmental constraints of construction. Topics such as permitting process, design/engineering services and ethical issues are included.", "SDGs": [3, 9, 16], "IsEstimate": 1.0}, {"Name": "PROJECT EVALUATION", "Subject": "CE", "Number": 3025.0, "Description": "In this course students are provided with a systematic framework for evaluating the economic sustainability and financial aspects of a building investment through its life cycle: project definition, design, construction and operation. The course develops according to several interrelated topics: budgeting (square foot cost and parametric estimating) and economic feasibility analysis, financing mechanisms, cash flow analysis, (time-value -of -money factors, present worth and rate of return), life-cycle assessment (environmental impact analysis), taxes, depreciation and regulations as well as consideration of risks and uncertainties.", "SDGs": [1, 8, 9, 12], "IsEstimate": 1.0}, {"Name": "MATERIALS OF CONSTRUCTION", "Subject": "CE", "Number": 3026.0, "Description": "This course provides an understanding of the use and acquisition of engineering properties of construction materials. Topics include relationships between the structure of materials, their engineering properties, and the selection of suitable materials for applications involving strength, durability, and serviceability. Experimental laboratory procedures including design of experiments, data collection, analysis, and representation, and report writing are an integral part of the work.", "SDGs": [9, 11, 12], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL ENGINEERING", "Subject": "CE", "Number": 3059.0, "Description": "This course provides an introduction to engineering aspects of environmental quality control. Students will learn fundamental science and engineering principles needed for environmental engineering, including concepts in chemistry, biology, physics, mass conservation, kinetics and reactor design. These principles are then applied to environmental engineering problems, including modeling of pollutants in natural systems and design of unit processes in engineered systems. Topics covered include environmental regulations, surface and ground water quality, drinking water treatment, wastewater treatment, air pollution, and hazardous waste management. ", "SDGs": [3, 6, 11, 14, 15, 16], "IsEstimate": 1.0}, {"Name": "WATER TREATMENT", "Subject": "CE", "Number": 3060.0, "Description": "This course provides in-depth coverage of processes used in water treatment. Topics include: review of water chemistry and drinking water standards, impurities in natural waters, aeration, water softening coagulation, flocculation, sedimentation, filtration, disinfection, taste and odor control, corrosion control, and iron and manganese removal.", "SDGs": [3, 6, 9, 14], "IsEstimate": 1.0}, {"Name": "WASTE WATER TREATMENT", "Subject": "CE", "Number": 3061.0, "Description": "This course provides in-depth coverage of processes used in wastewater treatment. Topics include: review of water quality standards, wastewater characteristics, application of biochemical oxygen demand, sources and effects of pollution, physical, chemical, and biological wastewater treatment processes, and waste sludge management.", "SDGs": [6, 11, 14], "IsEstimate": 1.0}, {"Name": "HYDRAULICS", "Subject": "CE", "Number": 3062.0, "Description": "This course provides a background for applying the principles of fluid mechanics to analyze and design hydraulic and fluid flow systems for projects related to water resources and civil and environmental engineering. Topics include hydraulics in pipes and closed systems, open channels and rivers, water supply systems and water distribution networks, pump systems and turbines, wastewater collection and treatment systems, and coastal and other natural environmental systems. Course content includes water quality and energy considerations, as well as the development and application of hydraulic models.", "SDGs": [6, 7, 9, 14, 16], "IsEstimate": 1.0}, {"Name": "URBAN AND ENVIRONMENTAL PLANNING", "Subject": "CE", "Number": 3070.0, "Description": "This course introduces to the student the social, economic, political, and environmental factors that affect the complex relationship between the built and natural environment. By using the principles of sustainable development and the procedures of planning, the optimal development pattern may be examined, and the infrastructure (roads, water supply systems, waste-water treatment systems, shopping malls, etc.) necessary to support present and future growth patterns may be determined. The information necessary in planning, which involves conscious procedures of analysis, formulation of alternative solutions, rational assessment and deliberate choice in accordance with evaluation criteria, is obtained through extensive reading. As such, the course introduces a variety of topics of concern to engineers and environmental scientists. The course is intended not only for civil engineering majors, but also for students preparing for an IQP in areas of urban or environmental concerns.", "SDGs": [6, 7, 8, 9, 11, 16], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL ANALYSIS", "Subject": "CE", "Number": 3074.0, "Description": "This course provides a background in the principles and techniques of assessing areas of natural environment and applying environmental assessments to evaluate the inherent suitability of these areas for sustainable urban and resource-based uses. Topic areas include basic concepts in sustainability, landscape characterization and analysis, and environmental impact assessment and planning. The concepts and techniques developed in this course are useful for land use planning, site design, natural resources management, and the determination of the impact of engineering projects on the environment.", "SDGs": [3, 9, 11, 12, 13, 14, 15], "IsEstimate": 1.0}, {"Name": "HYDROLOGY", "Subject": "CE", "Number": 4061.0, "Description": "This course introduces the concepts and principles governing the distribution and transport of water in the environment, and also provides a background for quantifying hydrologic processes as required for the development of water resources projects. Topics include the hydrologic cycle, precipitation, evaporation and transpiration, infiltration, runoff analysis, streamflow, hydrologic routing, statistics and probability in hydrology, and the quantification of hydrologic processes for water quality protection. The course introduces field techniques and the use of hydrologic models for solving problems in water resources and hydrology. Recommended background: ES 3004. This course will be offered in 2016-17, and in alternating years thereafter.", "SDGs": [6, 9, 11, 13, 14, 17], "IsEstimate": 1.0}, {"Name": "LAND USE DEVELOPMENT AND CONTROLS", "Subject": "CE", "Number": 4071.0, "Description": "The purpose of this course is to provide an understanding of the regulatory framework under which land is developed and the built environment is designed. The quality of our environment depends upon the development which is permitted to take place and the controls which direct that development. Through this course, the student will learn the principles, methods, and techniques which a planner or engineer may use to plan and design the highest and best uses and development of land. In particular, the use and limits of zoning, special permits, subdivision control, and other tools with which a developer or planner should be familiar will be examined in detail.", "SDGs": [9, 11, 15, 16], "IsEstimate": 1.0}, {"Name": "STRUCTURE, BONDING, AND REACTIVITY IN INORGANIC CHEMISTRY", "Subject": "CH", "Number": 3410.0, "Description": "This course provides the fundamental understanding of atomic, molecular and solid state structures and properties. Orbital structures of atoms, symmetry of molecules and point groups are used to understand chemical bonding and reactions. Various acid-base concepts are explored to analyze the acidity of cations and basicity of anions, solubility and precipitations of inorganic compounds, and metal-ligand binding affinities. Redox properties are discussed using Pourbaix diagrams. Thermodynamic stabilities of inorganic species are discussed using acid-base and redox concepts and thermochemical analyses are used to analyze chemical reactivity at atomic, molecular, and solid state level.", "SDGs": [6, 9], "IsEstimate": 1.0}, {"Name": "INTRODUCTION TO CHEMICAL ENGINEERING", "Subject": "CHE", "Number": 1011.0, "Description": "This course provides an introduction to the broad and vital discipline of chemical engineering including conventional and developing chemical technologies. An introduction is provided to the first principles of chemical engineering, as well as environmental, health, safety and ethical issues in chemical engineering practice. An overview is provided of the chemical engineering profession, career choices, the course of study, and a survey of the chemical industry, e.g., polymer, pharmaceutical, food processing, microelectronic, electrochemical, biotechnology, process control, energy, and petroleum refining. Course activities include guest speakers and plant trips.", "SDGs": [3, 6, 7, 9, 16], "IsEstimate": 1.0}, {"Name": "ENERGY CHALLENGES IN THE 21ST CENTURY", "Subject": "CHE", "Number": 3702.0, "Description": "The goal of this course is to prepare students for future work in energy-related fields by providing an overview of the challenges related to energy production. Students will study several major energy systems. The details of such energy systems will be examined using engineering principles, particularly focusing on relevant chemical processes. For example, the details and processes of a typical power plant or a refinery will be examined. Students will also become familiar with environmental and economic issues related to energy production. Topics to be covered may include: fossil fuels, the hydrogen economy, biofuels, nuclear energy, fuel cells, batteries, and the electricity grid.", "SDGs": [7, 8, 11, 13], "IsEstimate": 1.0}, {"Name": "UNIT OPERATIONS OF CHEMICAL ENGINEERING II", "Subject": "CHE", "Number": 4402.0, "Description": "Overall format and procedure are essentially the same as in Unit Operations of Chemical Engineering I. Laboratory projects include experiments in heat and mass transfer such as: heat transfer in two heaters and a cooler, climbing film evaporation, multiple effect evaporation, absorption, extraction, distillation and rotary drying of solids.", "SDGs": [7, 12], "IsEstimate": 1.0}, {"Name": "INTRODUCTION TO CONTEMPORARY ELECTRIC POWER SYSTEMS", "Subject": "ECE", "Number": 3500.0, "Description": "This course introduces basic concepts underlying the current and future methods of generation, transmission, storage, and use of electric energy. Beginning with an historical overview of the electric power system that has served well for more than 100 years, the course provides an introduction to the fundamental engineering principles underlying the design and implementation of traditional as well as modern electric power systems. Energy sources including thermal (combustion, nuclear, geothermal), solar, wind, and chemical (fuel cells) are presented, along with the environmental impacts. Concepts of three-phase systems, transmission and distribution of power, economic and regulatory aspects, as well as communications, protection, and control systems are included. Student project work is included.", "SDGs": [7, 13], "IsEstimate": 1.0}, {"Name": "INTRODUCTORY MICROECONOMICS", "Subject": "ECON", "Number": 1110.0, "Description": "The course focuses upon the implications of reliance upon markets for the allocation of resources in a society, at the household, firm, and community level. Outcomes of current market systems are examined in terms of the efficient use of natural and other economic resources, as well as their impact upon the environment, fairness, and social welfare of special interest in these analyses is the role of prices in the determination of what commodities are produced, their means of production, and distribution among households. In cases where current market outcomes have features subject to widespread criticism, such as the presence of excessive pollution, risk, discrimination, and poverty, the analysis is extended to suggest economic solutions.", "SDGs": [8, 9, 10, 11, 12], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL ECONOMICS", "Subject": "ECON", "Number": 2117.0, "Description": "This course investigates the effect of human activity upon the environment as well as the effect of the environment on human well-being. It pays special attention to the impact of production and consumption of material goods upon the quantity and quality of environmental goods. The analysis focuses on the challenges presented in mixed economics where markets are combined with government intervention to manage pollution and scarcity. The course reviews efforts to measure the costs and benefits of improving environmental conditions and evaluates current and potential policies in terms of the costs of the environmental improvements they may yield. Attention is also paid to the special difficulties which arise when the impacts of pollution spill across traditional political boundaries. ", "SDGs": [3, 8, 10, 12, 13, 16], "IsEstimate": 1.0}, {"Name": "PUBLIC ECONOMICS", "Subject": "ECON", "Number": 2126.0, "Description": "This course examines the economics of government expenditure and taxation. On the expenditure side, the course will review why governments often choose to be involved in the provision of healthcare, education, national defense, a clean environment, and infrastructure such as roads and bridges. It will also delve into the rationale behind programs such as social security. Regarding taxation, the course will cover income, consumption, and corporate taxes, including the use of corrective taxes to address market failures due to externalities. Within each topic, the relevant economic theories will be presented, and then students will practice applying the theories to real-world examples. As such, there will be plenty of opportunity to discuss policy implications and debate proposed policy changes. ", "SDGs": [3, 4, 8, 9, 10, 13, 16], "IsEstimate": 1.0}, {"Name": "LITERATURE AND THE ENVIRONMENT", "Subject": "EN", "Number": 2237.0, "Description": "This course will examine the many ways in which dramatists, essayists, filmmakers, novelists, and poets have articulated ecological and environmental concerns. Topics to be discussed may include changing attitudes towards terms like 'nature' and 'wilderness', the effects of technology on the environment, issues of conservation and sustainability, the dynamics of population growth, the treatment of animals, the production of food, and the presence of the spiritual in nature. Materials will include works by writers such as Wendell Berry, Rachel Carson, Winona LaDuke, Wangari Maathai, Thomas Malthus, Arne Naess, Nicolas Roeg, and Gary Snyder.", "SDGs": [2, 3, 4, 5, 10, 12, 13, 14, 15, 16], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL GOVERNANCE AND INNOVATION", "Subject": "ENV", "Number": 2310.0, "Description": "With global attention dominated by environmental catastrophe and despair, we will spotlight new work that has brought together scientists, environmentalists, engineers, and artists to tackle the most serious problems facing communities. We will explore the political ecology implications of control over essential resources and the positive consequences of rethinking and democratizing basic social needs for a more sustainable future. Recent exciting case studies will feature examples of simple solutions that inspire elegant, transferrable, and inexpensive applications of technological design. We will examine the role and obligation that scientists have to collaborate with interdisciplinary and public policy efforts that benefit people with sustainable approaches to architecture, food, energy, transportation, and infrastructure.", "SDGs": [2, 7, 9, 11, 12, 13, 16], "IsEstimate": 1.0}, {"Name": "THE GREEN ECONOMY AND MODELS FOR ALTERNATIVE FORMS OF DEVELOPMENT.", "Subject": "ENV", "Number": 2900.0, "Description": "This course examines the limitations of traditional economic models and charts a new course for current policies and practices. To chart this path we draw upon and synthesize examples from existing alternative economies (e.g., different forms of dematerialization, hybrid organizations, solidary economy, sharing economy).The course critically examines current paradigms of greening and seeks to expand thinking that will encompass new, alternative, and socially just conceptions of economy and economic development. A particular emphasis is laid on the spatial implications of de-growth oriented activities which partly challenge existing models and research methods in economic geography.", "SDGs": [8, 9, 12, 16], "IsEstimate": 1.0}, {"Name": "ADVENTURES IN SUSTAINABLE URBANISM.", "Subject": "ENV", "Number": 3100.0, "Description": "This course will take students on an adventure, both in the class and in the field. Students will examine the history of sustainable development, its antecedents, the factors that have influenced its evolution, and how the sustainable city came into existence. Students will be invited on a number of virtual field trips to sustainable cities from around the world. The goal will be to explore the underlying factors of sustainable urbanism, why it looks the way it does in different places, and how students can exercise their own agency in developing alternatives. Students will also develop their own field trips for publication on the course website.", "SDGs": [11.0], "IsEstimate": 1.0}, {"Name": "INTRODUCTION TO ENVIRONMENTAL STUDIES", "Subject": "ENV", "Number": 1100.0, "Description": "The study of environmental problems and their solutions requires an interdisciplinary approach. This course will examine current environmental issues from the intersection of several key disciplines including: environmental philosophy and history, environmental policy, and science. The course will develop these different approaches for analyzing environmental problems, explore the tensions between them, and present a framework for integrating them. Topics such as environmental justice, developing nations, globalization, and climate change policy will be explored.", "SDGs": [1, 2, 3, 4, 12, 13, 16, 17], "IsEstimate": 1.0}, {"Name": "INTRODUCTION TO GRAPHICAL INFORMATION SYSTEMS", "Subject": "ENV", "Number": 1500.0, "Description": "This course introduces Geographic Information Systems (GIS) as a powerful mapping and analytical tool. Topics include GIS data structure, map projections, and fundamental GIS techniques for spatial analysis. Laboratory exercises concentrate on applying concepts presented in lectures and will focus on developing skills using ArcGIS. These exercises include examples of GIS applications in environmental modeling, socio-demographic change and site suitability analyses. Although the course is computer-intensive, no programming background is required. This course will be offered in 2015-16 and in alternating years thereafter. ", "SDGs": [3, 4, 5, 10, 11], "IsEstimate": 1.0}, {"Name": "PLANNING FOR SUSTAINABLE COMMUNITIES", "Subject": "ENV", "Number": 2201.0, "Description": "Sustainability planning seeks to anticipate and balance environmental, social, and economic impacts of human actions. This course presents an overview of how various perspectives can contribute to frameworks for environmental land use planning and management. Students are encouraged to think critically about problems land and natural resource use pose to society. Technical principles and analysis of sustainability planning are introduced and applied to challenges that communities currently face such as food, fiber and energy production, environmental conservation, hazard mitigation and resilience, water security, economic development, and waste management. Techniques to engage a diverse set of stakeholders in a collaborative planning process are examined along with the role of technology.", "SDGs": [2, 6, 7, 8, 11, 14, 15, 17], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL PROBLEMS AND HUMAN BEHAVIOR", "Subject": "ENV", "Number": 2400.0, "Description": "This course examines how people think about and behave toward the environment. Environmental problems can ultimately be attributed to the environmental decisions and actions of human beings. These behaviors can in turn be understood as resulting from the nature and limitations of the human mind and the social context in which behavior takes place. Knowledge of the root causes of environmentally harmful behavior is essential for designing effective solutions to environmental problems. The goals of the course are (1) to provide students with the basic social science knowledge needed to understand and evaluate the behavioral aspects of such important environmental problems as air and water pollution, global warming, ozone depletion, preserving biological diversity, and hazardous waste and (2) to help students identify and improve shortcomings in their knowledge and decisions related to the environment. Topics will include, but not be limited to: environmental problems as \"tragedies of the commons\"; public understanding of global warming and global climate modeling; folk biology; risk perception; intelligent criticism of environmental claims; making effective environmental choices; strategies for promoting pro-environmental behavior; and human ability to model and manage the global environmental future. ", "SDGs": [4, 6, 13, 14, 15, 17], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL PROBLEMS IN THE DEVELOPING WORLD", "Subject": "ENV", "Number": 2600.0, "Description": "Environment and development are often seen as incompatible, in part because many poor people in the developing world depend directly on natural resources for their livelihoods. At the same time, poor people are often seen as responsible for causing environmental degradation because they lack the knowledge, skills and resources to manage the environment effectively. The vicious circle is completed as environmental degradation exacerbates poverty. However, optimists argue that poor people can and do contribute positively to environmental o utcomes, that states and organizations can facilitate their efforts and that environmental interventions can coincide with development. This course will examine these different perspectives on environmental problems in the developing world through the insights and critiques of social science. Subjects covered include sustainable development, population, environmental risks, gender, urbanization, environmental decision making, and non-governmental organizations (NGOs). The goals of this course are to think critically about the various links between environment and development and the role of governmental and non-governmental organizations in promoting sustainable development in the developing world.", "SDGs": [1, 2, 4, 5, 9, 11], "IsEstimate": 1.0}, {"Name": "SOCIAL MEDIA, SOCIAL MOVEMENTS, AND THE ENVIRONMENT", "Subject": "ENV", "Number": 2700.0, "Description": "Social media platforms are changing the world of social movements, giving rise to a new generation of social activism. Social media can enable local actors to link with others from across the globe to incite social and environmental change. Social media has enabled people to document and share injustices (e.g., violence; dumping of toxic waste) in places where freedom of the press is limited or non-existent, and it has enabled people across different social groups (race, class, etc.) to engage with one another on issues of shared concern. Social media has also allowed people to share resources (financial, expertise, and organizational) with other social actors across the globe, empowering communities in novel ways. This course introduces students to the phenomena of social and environmental movements, theories on why they succeed and fail, and how social media has changed the landscape of social mobilization. This course will draw on interdisciplinary readings, concepts, and case studies from the social sciences, with emphasis on geography, public policy, sociology, and media studies. Course work will include small group projects, analyses of current social movement cases, and a final project. The final project will consist of interviewing members of a current social movement (potentially using social media), evaluating whether particular social media applications have helped to enable social mobilization, and designing new or revised social media tools to further enhance social mobilization. ", "SDGs": [5, 8, 10, 16, 17], "IsEstimate": 1.0}, {"Name": "MASS TRANSFER", "Subject": "ES", "Number": 3002.0, "Description": "This course introduces the student to the phenomena of diffusion and mass transfer. These occur in processes during which a change in chemical composition of one or more phases occurs. Diffusion and mass transfer can take place in living systems, in the environment, and in chemical processes. This course will show how to handle quantitative calculations involving diffusion and/or mass transfer, including design of process equipment. Topics may include: fundamentals of diffusional transport, diffusion in thin films; unsteady diffusion; diffusion in solids; convective mass transfer; dispersion; transport in membranes; diffusion with chemical reaction; simultaneous heat and mass transfer; selected mass transfer operations such as absorption, drying, humidification, extraction, crystallization, adsorption, etc.", "SDGs": [6], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL IMPACTS OF ENGINEERING DECISIONS", "Subject": "ES", "Number": 2800.0, "Description": "Engineering decisions can affect the environment on local and global scales. This course will introduce students to concepts that will make them aware of the ramifications of their engineering decisions, and is intended for engineering students of all disciplines. Specific topics the course will cover include: environmental issues, waste minimization, energy conservation, water conservation and reuse, regulations (OSHA, TSCA, RCRA, etc.), life cycle assessment, risk assessment, sustainability, design for the environment, and environmental impact statements. Energy and mass balances will be applied to activities that impact the environment. Instruction will be provided through lectures, practitioner seminars, and a term project. Intended audience: all engineering majors desiring a general knowledge of the environmental impacts of engineering decisions. ", "SDGs": [6, 7, 12, 13, 16], "IsEstimate": 1.0}, {"Name": "ENGINEERING INNOVATION AND ENTREPRENEURSHIP", "Subject": "ETR", "Number": 1100.0, "Description": "In the modern competitive and global world confronting today’s engineers, innovation and entrepreneurship (I&E) are increasingly important perspectives for every engineering career. Individuals proficient in I&E are likely to possess unique competitive advantage over those who do not. This course develops the foundation for developing such proficiency by examining the functional roles of the business/commercial aspects of engineering disciplines as well as establishing a basis for innovative thinking. Specific cases where I&E has led to new products innovation and new enterprise development will supplement course materials.", "SDGs": [8, 9], "IsEstimate": 1.0}, {"Name": "SOCIAL ENTREPRENEURSHIP", "Subject": "ETR", "Number": 2900.0, "Description": "This course will introduce students to the concept of social entrepreneurship and the ways in which social entrepreneurs are addressing complex social problems with their entrepreneurial ventures. Students will be exposed to the challenges and rewards of running a social enterprise. They will learn valuable business and entrepreneurial tools that can be applied to the design of sustainable social business models. Topics include social opportunity recognition and evaluation, business models in the social sector, social impact assessment, the double-bottom line, scalability of solutions, organizational forms and structures, and social venture financing.", "SDGs": [8, 9], "IsEstimate": 1.0}, {"Name": "GEOLOGY", "Subject": "GE", "Number": 2341.0, "Description": "Students of this course will examine the fundamental principles of physical geology including the materials, structures, and surface features of the earth and the processes which produced them. Emphasis will be placed on the interrelationship of people and environment and applications to various fields of technology. The course includes field trips and a significant laboratory component.", "SDGs": [12, 13, 14, 15], "IsEstimate": 1.0}, {"Name": "SCIENCE-TECHNOLOGY POLICY", "Subject": "GOV", "Number": 2302.0, "Description": "This course is an examination of the relationship between science-technology and government. It reviews the history of public policy for science and technology, theories and opinions about the proper role of government and several current issues on the national political agenda. Examples of these issues include genetic engineering, the environment and engineering education. It also examines the formation of science policy, the politics of science and technology, the science bureaucracy, enduring controversies such as public participation in scientific debates, the most effective means for supporting research, and the regulation of technology. Throughout the course we will pay particular attention to the fundamental theme: the tension between government demands for accountability and the scientific community's commitment to autonomy and self-regulation. ", "SDGs": [10, 16], "IsEstimate": 1.0}, {"Name": "ENVIRONMENTAL POLICY AND LAW", "Subject": "GOV", "Number": 2311.0, "Description": "This course deals with environmental law as it relates to people, pollution and land use in our society. A case method approach will be used to illustrate how the courts and legislators have dealt with these social-legal problems. The course is designed to have the student consider: 1) the legal framework within which environmental law operates; 2) the governmental institutions involved in the formulation, interpretation and application of environmental law; 3) the nature of the legal procedures and substantive principles currently being invoked to resolve environmental problems; 4) the types of hazards to the environment presently subject to legal constraints; 5) the impact that the mandates of environmental law have had, and will have, on personal liberties and property rights; 6) the role individuals and groups can play within the context of our legal system to protect and improve man's terrestrial habitat and the earth's atmosphere; and 7) some methods and sources for legal research that they may use on their own. ", "SDGs": [10, 13, 15, 16], "IsEstimate": 1.0}, {"Name": "INTERNATIONAL ENVIRONMENTAL POLICY", "Subject": "GOV", "Number": 2312.0, "Description": "Environmental issues present some of the major international problems and opportunities facing the world today. Worst-case scenarios envision irrevocable degradation of the earth's natural systems, but virtually every analysis sees the need for major change worldwide to cope with problems such as global warming, deforestation, ozone layer depletion, loss of biodiversity, and population growth, not to mention exponential increases in \"conventional\" pollutants in newly industrialized countries. The global environment issues represent a \"second-generation\" of environmental policy in which the focus of concern has moved from national regulations to international law and institutions. In addition, the environment has emerged as a major aspect of international trade, conditioning corporate investment and accounting for some $200 billion in sales of pollution control equipment in 1991. Exploration of the genesis and implications of these phenomena is the essence of the course. Topically, the material begins with the nature of global environmental problems, drawing on literature from large-scale global modeling as well as particular analyses of the problems mentioned above. Approximately half the course focuses on international laws and institutions, including multilateral treaties (e.g., the Montreal Protocol limiting CFC use, ocean dumping, biodiversity), international institutions (UNEP, the Rio Convention, the OECD) and private initiatives (international standards organizations, ICOLP (Industry Committee for Ozone Layer Protection), etc.) In addition, US policy toward global environmental issues will be compared with that in Japan, Europe and developing countries, from which it differs significantly. Students will design and undertake term projects that address particular issues in detail in an interdisciplinary manner. ", "SDGs": [13, 16], "IsEstimate": 1.0}, {"Name": "INTRODUCTION TO AMERICAN URBAN HISTORY", "Subject": "HI", "Number": 1311.0, "Description": "An introduction to the history of the American city as an important phenomenon in itself and as a reflection of national history. The course will take an interdisciplinary approach to study the political, economic, social, and technological patterns that have shaped the growth of urbanization. In addition to reading historical approaches to the study of American urban history, students may also examine appropriate works by sociologists, economists, political scientists and city planners who provide historical perspective.", "SDGs": [8, 9, 11, 16], "IsEstimate": 1.0}, {"Name": "TOPICS IN ENVIRONMENTAL HISTORY", "Subject": "HI", "Number": 3317.0, "Description": "In this seminar course, students will explore one aspect of U.S. or global environmental history in more depth. Topics vary each year but may include environmental thought, environmental reform movements, comparative environmental movements, natural disasters, the history of ecology, built environments, environmental justice, New England environmental history, or the environmental history of South Asia or another region of the world. The course will require substantial reading and writing.", "SDGs": [4, 16], "IsEstimate": 1.0}, {"Name": "TOPICS IN THE HISTORY OF NON-WESTERN SCIENCE AND TECHNOLOGY", "Subject": "HI", "Number": 3335.0, "Description": "A seminar course on the relationships among science, technology, and society from cultures outside Europe and North America, examined through a series of case studies. Topics from which the case studies might be drawn include: Chinese medicine and technology; Arabic mathematics, medicine, and astronomy; Indian science and technology (including, for example, metalworking and textile production); Mayan mathematics and astronomy; Polynesian navigation; various indigenous peoples' sustainable subsistence technologies (e.g. African agriculture, Native American land management, aboriginal Australian dreamtime). ", "SDGs": [3], "IsEstimate": 1.0}, {"Name": "TOPICS IN GLOBAL STUDIES", "Subject": "INTL", "Number": 2910.0, "Description": "This seminar course takes an interdisciplinary approach to historical and contemporary topics in global studies. Topics vary each year and may include international development, global inequality and justice, global public health, war and terrorism, international organizations and governance, humanitarianism and human rights, travel and tourism, the Anthropocene, climate change. No prior background is required. Especially appropriate for students interested in any of WPI’s global Project Centers.", "SDGs": [1, 2, 3, 5, 10, 13, 16], "IsEstimate": 1.0}, {"Name": "RADIATION HEAT TRANSFER APPLICATION AND DESIGN", "Subject": "ME", "Number": 4424.0, "Description": "Radiation Heat Transfer Applications will develop the student’s knowledge of radiation and multi-mode heat transfer. Fundamentals of radiation will be covered: radiative properties of surfaces; view factors; exchange between black and grey surfaces; emission and absorption of gases; and flame radiation. Use of numerical methods will be emphasized as appropriate for solution of applications: the select numerical methods (numerical integration, matrix methods, ODE solutions) can be learned during the course. The course will conclude with a design exercise to be completed by each student. Each exercise will highlight radiation in a realistic scenario that requires multi-mode heat transfer and fluid mechanics analysis to develop the design solution. Exercise topics will come from subjects such as: solar power plants, solar effects on buildings, furnaces, fire safety in the built environment, etc.", "SDGs": [7], "IsEstimate": 1.0}, {"Name": "THERMOFLUID APPLICATION AND DESIGN", "Subject": "ME", "Number": 4429.0, "Description": "This course integrates thermodynamics, fluid mechanics and heat transfer through the use of design projects involving modern technologies, such as electronic cooling, vapor compression power and refrigeration cycles. Activities include problem definition, design creation and analysis, mathematical modeling, cost analysis and optimization.", "SDGs": [8], "IsEstimate": 1.0}, {"Name": "AUTOMOTIVE MATERIALS AND PROCESS DESIGN", "Subject": "ME", "Number": 4810.0, "Description": "This course focuses on materials used in the automotive industry. Students complete a term-long project that integrates design, materials selection and processing considerations. Activities include: problem definition, development of design specifications, development and analysis of alternative designs, conceptual designs and materials and process selection. Students will consider cost, and environmental impact of alternative material choices. Students will present their results in intermediate and final design reviews.", "SDGs": [8, 9, 13, 14, 15], "IsEstimate": 1.0}, {"Name": "PLASTICS", "Subject": "ME", "Number": 4821.0, "Description": "This course develops the processing, structure, property, performance relationships in plastic materials. The topics covered include polymerization processes, chain structure and configuration, molecular weights and distributions, amorphous and crystalline states and glass-rubber transition. The principles of various processing techniques including injection molding, extrusion, blow molding, thermoforming and calendaring will be discussed. The physical and mechanical properties of polymers and polymer melts will be described with specific attention to rheology and viscoelasticity. Pertinent issues related to environmental degradation and recyclability will be highlighted. Recommended Background: ES 2001 or equivalent. This course will be offered in 2015-16, and in alternating years thereafter.", "SDGs": [12], "IsEstimate": 1.0}, {"Name": "MATERIALS MANAGEMENT IN SUPPLY CHAINS", "Subject": "OIE", "Number": 3410.0, "Description": "This course in an introduction to the planning and controlling the material flow into, through, and out of an organization. It explains fundamental relationships among the activities that occur in the supply chain from suppliers to customers. In particular, the course addresses types of manufacturing systems, demand management and forecasting, master production scheduling, materials requirements planning, capacity management, inventory management, distribution resource planning, JIT and lean principles, and other current topics that are pertinent to managing the material flow of supply chains.", "SDGs": [12], "IsEstimate": 1.0}, {"Name": "QUALITY PLANNING, DESIGN AND CONTROL", "Subject": "OIE", "Number": 3420.0, "Description": "This course provides students with the analytical and management tools necessary to solve manufacturing and service quality problems. Topics include customer needs and quality, quality and cost relationships, process capability analysis, statistical process control, control charts for variables and attributes, design of experiments, and other Six Sigma problem solving methodology.", "SDGs": [8, 12], "IsEstimate": 1.0}, {"Name": "GLOBAL PLANNING AND LOGISTICS", "Subject": "OIE", "Number": 4460.0, "Description": "This case-based course will examine methods and strategies for managing and controlling material movement, with particular emphasis on international operations, from the purchase of production materials to the control of work in process to the distribution of the finished product. Strategies that will be discussed include the design of international distribution networks, the use of third-party logistics providers, and the creation of links between logistic systems and marketing to create competitive advantage. The course will also explore tactical issues that must be managed to pursue a logistics strategy successfully, including choices regarding means of transportation, packaging, and inventory policies. Underlying themes of the course will be the use of information technologies (such as electronic data interchange and bar coding) and mathematical models to support logistics decision-making.", "SDGs": [8, 9, 12, 17], "IsEstimate": 1.0}, {"Name": "BIOETHICS", "Subject": "PY", "Number": 2713.0, "Description": "The purpose of this course is to evaluate the social impact of technology in the areas of biology/biotechnology, biomedical engineering and chemistry. The focus of the course will be on the human values in these areas and how they are affected by new technological developments. The course will deal with problems such as human experimentation, behavior control, death, genetic engineering and counseling, abortion, and the allocation of scarce medical resources. These problems will be examined through lectures, discussions and papers.", "SDGs": [3, 10], "IsEstimate": 1.0}, {"Name": "SOCIAL AND POLITICAL PHILOSOPHY", "Subject": "PY", "Number": 2712.0, "Description": "This course examines metaphysical and moral questions that philosophers have raised about social and political life. Among questions treated might be: What are the grounds, if any, of the obligation of a citizen to obey a sovereign? Are there basic principles of justice by which societies, institutions and practices are rightly evaluated? What is democracy, and how can we tell if an institution or practice is democratic? To what degree do economic institutions put limits on the realization of freedom, democracy and self-determination? Readings might include excerpts from the works of Plato, Hobbes, Locke, Rousseau and Marx, as well as numerous contemporary philosophers.", "SDGs": [16], "IsEstimate": 1.0}, {"Name": "PHILOSOPHY OF SCIENCE", "Subject": "PY", "Number": 2719.0, "Description": "This course is an in-depth consideration of the meaning, value, and consequences of scientific inquiry. Questions explored may include: Does science yield truth? Are the results of scientific inquiry more a reflection of the workings of the human mind than of those of the external world? Do pivotal scientificconcepts like gene, electron, photon, species, and ecosystem point to entities that actually exist? Does the history of science, which includes many refutations of theories once believed to be true, raise questions about whether currently accepted theories should be trusted? By what methods does a scientific community validate knowledge claims and how are these processes affected by social, political, and economic contexts? Does a scientist have a responsibility to conduct morally conscientious research? How does the development of technology affect our spiritual and moral characters? In what ways is science similar to religion and in what ways is it different? The focus of this course may vary each time it is offered from an examination of science in general to an investigation of the foundations of specific branches of science such as physics, biology, environmental science, or social science.", "SDGs": [16], "IsEstimate": 1.0}, {"Name": "INTRODUCTORY ETHICS", "Subject": "PY", "Number": 2731.0, "Description": "This course will review at an introductory level theories of ethics, individual figures in the history of ethics, and selected problems in ethics. The emphasis will be on philosophical or religious ethics depending on the instructor.", "SDGs": [3, 16], "IsEstimate": 1.0}, {"Name": " PHILOSOPHY OF RELIGION", "Subject": "PY", "Number": 3712.0, "Description": "This course will focus on philosophical questions concerning the following topics: the existence and nature of God; the compatibility of God and evil; the nature of religious faith and the relationship between religion, science and ethics; interpretations of the nature of religious language; the philosophically interesting differences between Western and Eastern religions; philosophical critiques of the role of religion in social life. Authors may include: Hume, Kant, Kierkegaard, Buber, Tillich, Daly, Nietzsche and Buddha.", "SDGs": [16], "IsEstimate": 1.0}, {"Name": "INTRODUCTION TO SYSTEM DYNAMICS MODELING", "Subject": "SD", "Number": 1510.0, "Description": "The goal of this course is to provide students with an introduction to the field of system dynamics computer simulation modeling. The course begins with the history of system dynamics and the study of why policy makers can benefit from its use. Next, students systematically examine the various types of dynamic behavior that socioeconomic systems exhibit and learn to identify and model the underlying nonlinear stock-flow-feedback loop structures that cause them. The course concludes with an examination of a set of well-known system dynamics models that have been created to address a variety of socioeconomic problems. Emphasis is placed on how the system dynamics modeling process is used to test proposed policy changes and how the implementation of model-based results can improve the behavior of socioeconomic systems.", "SDGs": [8, 9, 10], "IsEstimate": 1.0}, {"Name": "FUNDAMENTALS OF GLOBAL HEALTH", "Subject": "STS", "Number": 1200.0, "Description": "The focus of global health research and practice is improving the overall health and health equity of all people worldwide. In this course, we will use an interdisciplinary approach to explore the major biological, social, political, environmental and economic determinants of health. We will analyze the dual burden of communicable and non-communicable disease facing the world's populations including study of current health systems, global health practices and priorities as well as major organization and institutional players. Class sessions will consist of lecture, intensive small group discussion, and global health case analyses. After successful completion of this course, students will be able to explain the basic principles of public health; discuss the determinants of health; describe how globalization has changed the patterns of the spread of disease and the methods needed to control disease; evaluate the complex, multi-faceted links between health, social and economic factors; and identify critical issues in the delivery of health care services, with a particular emphasis on challenges faced with regard to different cultural and economic settings.", "SDGs": [1, 2, 3, 8, 10, 16], "IsEstimate": 1.0}]