[
  {
    "Name": "SENIOR SEMINAR IN ENVIRONMENTAL STUDIES",
    "Subject": "ENV",
    "Number": 4400.0,
    "Description": "This course is intended for Environmental Studies majors. The course is designed to integrate each student's educational experience (e.g., core environmental courses, environmental electives, and environmental projects) in a capstone seminar in Environmental Studies. Through seminar discussions and writing assignments students will critically reflect on what they learned in their previous courses and project experiences. In teams, students will prepare a final capstone paper and presentation that critically engages their educational experience in environmental studies and anticipates how their courses and experiences will translate into their future personal and professional environmental experiences.",
    "SDGs": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
  },
  {
    "Name": "ENVIRONMENTAL IMPACTS OF ENGINEERING DECISIONS",
    "Subject": "ES",
    "Number": 3002.0,
    "Description": "Engineering decisions can affect the environment on local and global scales. This course will introduce students to concepts that will make them aware of the ramifications of their engineering decisions, and is intended for engineering students of all disciplines. Specific topics the course will cover include: environmental issues, waste minimization, energy conservation, water conservation and reuse, regulations (OSHA, TSCA, RCRA, etc.), life cycle assessment, risk assessment, sustainability, design for the environment, and environmental impact statements. Energy and mass balances will be applied to activities that impact the environment. Instruction will be provided through lectures, practitioner seminars, and a term project. Intended audience: all engineering majors desiring a general knowledge of the environmental impacts of engineering decisions.",
    "SDGs": []
  },
  {
    "Name": "HUMANITARIAN ENGINEERING: PAST AND PRESENT",
    "Subject": "ES",
    "Number": "200X",
    "Description": "This course will focus on understanding the engineering and humanitarian challenges connected to designing a sanitation system in the developing world or in an under-resourced part of the developed world. Students will study social and stakeholder considerations as well as treatment and transport, which will inform the design of a prototype system using appropriate locally available resources. This is a project-based, hands-on research and solution-based course in which students will be divided into teams of 3 or 4 persons each. Each team will have weekly objectives/assignments that will be presented to the whole class via oral presentations. Discussion, criticism, suggestions, etc. will follow each team's in-class presentation. The purpose of these peer evaluations is to drive the development of the final physical model of the solution, and the building of the final poster for presentation.",
    "SDGs": []
  },
  {
    "Name": "GLOBAL ENVIRONMENTAL POLITICS",
    "Subject": "GOV",
    "Number": 2319.0,
    "Description": "It is apparent that environmental problems have outgrown national policy frameworks. Thus, institutions have emerged at the international and transnational levels to coordinate collective problem solving. But governance involves more than just the practicality of problem solving; it also involves uncertainty, controversy, power and politics. This course will examine the ways in which global environmental governance has been conceived: from establishing international institutions and agreements, to less tangible ways of interacting. We will examine themes such as scales of governance (from the United Nations to communities), policy networks, the role of NGOs, think tanks and special interests and the role of knowledge in global environmental debates. Students will then use this conceptual and theoretical basis to analyze major global environmental issues including: deforestation; biodiversity; endangered species; and climate change. The goals of this course are to gain an understanding of the main positions in global environmental debates; critically analyze these positions; and gain insight into the politics of global environmental policy and governance.",
    "SDGs": []
  },
  {
    "Name": "BUILDING PHYSICS",
    "Subject": "AREN",
    "Number": 2023.0,
    "Description": "The course introduces the principles of building physics, as they are applied to various building design situations and performance requirements. Covered topics include heat transfer, moisture control, condensation, cold bridging, external and internal gains, and air flows, as they pertain to building envelopes (external walls, windows and doors, and roofs) and the requirements of environmental comfort of space occupants. Design exercises take into account pertinent building and energy codes as well as comfort standards. The course gives students the tools to integrate engineering science fundamentals and physics principles in developing building design solutions. Thermal measurements in building components are performed.",
    "SDGs": []
  },
  {
    "Name": "ARCHITECURAL GRAPHICS AND COMMUNICATION",
    "Subject": "AREN",
    "Number": 3002.0,
    "Description": "With this course, students develop an understanding of the architectural design process and the graphic means for communicating and exchanging design content during the execution of a building project. The course covers the following topics: Nature of design (problems, solutions and process), building siting and orientation aimed at reducing energy requirements, architectural drawings (plans, elevations and cross sections), isometric projections and detail drawings. Most of these topics build upon the systematic use of electronic modeling software. This course is lab oriented.",
    "SDGs": []
  },
  {
    "Name": "BIODIVERSITY",
    "Subject": "BB",
    "Number": 2030.0,
    "Description": "Through lectures, readings, and discussions this course will examine the breadth, patterns, mechanisms, and conservation of biodiversity. Case studies and peer-to-peer learning will be used to examine threats to regional and global biodiversity and assess management and engineering strategies for solutions to the biodiversity crisis. Students will investigate and interpret past and contemporary research to quantify, document, and track trends in biodiversity. This course will use problem sets and assignments to explore the natural, social, and economic tradeoffs associated with threats to and conservation of biodiversity. Students will develop an area of expertise and synthesize their comprehension of topics through project work (e.g., management plan, report, presentation, citizen science). Finally, this course will provide a synthesis of the interdisciplinary nature of biodiversity conservation and how principles of conservation biology, landscape ecology, metapopulation biology, and biogeography can be applied to strategies aimed towards sustaining Earth?s biota.",
    "SDGs": []
  },
  {
    "Name": "ECOLOGY, ENVIRONMENT, AND ANIMAL BEHAVIOR",
    "Subject": "BB",
    "Number": 2904.0,
    "Description": "This course examines topics in ecology and animal behavior through hands on experimentation and simulation. Activities in this course include interactions and observation of live animals as well as some outdoor activities and environmental sampling. This course will be relevant to students who have an interest in biology at more than the individual organism level as well as those with majors involving environmental and ecological concerns. Examples of the specific types of techniques and experience included in this course are: ? Observing, recording, understanding, and analyzing animal behaviors ? Handling of organisms ? Environmental and ecological assessment and sampling ? Observations of population dynamics",
    "SDGs": []
  },
  {
    "Name": "HYDRAULICS",
    "Subject": "CE",
    "Number": 3062.0,
    "Description": "This course provides a background for applying the principles of fluid mechanics to analyze and design hydraulic and fluid flow systems for projects related to water resources and civil and environmental engineering. Topics include hydraulics in pipes and closed systems, open channels and rivers, water supply systems and water distribution networks, pump systems and turbines, wastewater collection and treatment systems, and coastal and other natural environmental systems. Course content includes water quality and energy considerations, as well as the development and application of hydraulic models.",
    "SDGs": []
  },
  {
    "Name": "ENVIRONMENTAL ENGINEERING LABORATORY",
    "Subject": "CE",
    "Number": 4060.0,
    "Description": "This course familiarizes students with the laboratory studies used to obtain the design parameters for water and wastewater treatment systems. The topics include laboratory experiments dealing with physical, chemical, and biological treatment systems.",
    "SDGs": [6, 14]
  },
  {
    "Name": "HAZARDOUS AND INDUSTRIAL WASTE MANAGEMENT",
    "Subject": "CE",
    "Number": 4600.0,
    "Description": "This course will cover concepts and techniques for handling hazardous and industrial wastes. Regulations governing hazardous waste, water & soil remediation concepts, and the fundamentals of waste treatment processes will be discussed. Instruction will be provided through lectures, fieldtrips, practitioner seminars, and class problem solving sessions.",
    "SDGs": []
  },
  {
    "Name": "ENERGY CHALLENGES IN THE 21ST CENTURY",
    "Subject": "CHE",
    "Number": 4404.0,
    "Description": "The goal of this course is to prepare students for future work in energy-related fields by providing an overview of the challenges related to energy production. Students will study several major energy systems. The details of such energy systems will be examined using engineering principles, particularly focusing on relevant chemical processes. For example, the details and processes of a typical power plant or a refinery will be examined. Students will also become familiar with environmental and economic issues related to energy production. Topics to be covered may include: fossil fuels, the hydrogen economy, biofuels, nuclear energy, fuel cells, batteries, and the electricity grid.",
    "SDGs": []
  },
  {
    "Name": "INTRODUCTION TO CONTEMPORARY ELECTRIC POWER SYSTEMS",
    "Subject": "ECE",
    "Number": 3500.0,
    "Description": "This course introduces basic concepts underlying the current and future methods of generation, transmission, storage, and use of electric energy. Beginning with an historical overview of the electric power system that has served well for more than 100 years, the course provides an introduction to the fundamental engineering principles underlying the design and implementation of traditional as well as modern electric power systems. Energy sources including thermal (combustion, nuclear, geothermal), solar, wind, and chemical (fuel cells) are presented, along with the environmental impacts. Concepts of three-phase systems, transmission and distribution of power, economic and regulatory aspects, as well as communications, protection, and control systems are included. Student project work is included.",
    "SDGs": []
  },
  {
    "Name": "DEVELOPMENT ECONOMICS",
    "Subject": "ECON",
    "Number": 1110.0,
    "Description": "This course is a general introduction to the field of development economics. The focus is on ways in which a developing country can increase its productive capacity, both agricultural and industrial, in order to achieve sustained economic growth. The course proceeds by first examining how economic growth and economic development are measured and how the various nations of the world compare according to well-known social and economic indicators. Theories of economic growth and theories of economic development are then examined, as are the various social and cultural structures that are thought to influence economic progress. The inputs to economic growth and development (land, labor, capital, entrepreneurial ability, education, technical change), and the possible distributions of income and levels of employment that result from their use, is considered next. Domestic economic problems and policies such as development planning, the choice of sectorial policies, the choice of monetary and fiscal policies, rapid population growth, and urbanization and urban economic development are then examined. The course concludes with a consideration of international problems and policies such as import substitution and export promotion, foreign debt, foreign investment, and the role of international firms. In conjunction with a traditional presentation of the above topics, the course curriculum will include the use of computer simulation models and games. These materials have been formulated with a simulation technique, system dynamics, that has its origins in control engineering and the theory of servomechanisms. As a result, students will find them complementary to their work in engineering and science. In addition, the various development theories and simulation and gaming results will be related, where possible, to specific developing nations where WPI has ongoing project activities (e.g., Costa Rica and Thailand). This course is recommended for those students wishing to do an IQP or MQP in a developing nation.",
    "SDGs": [1, 2, 3, 4, 5, 9, 10, 11, 12]
  },
  {
    "Name": "ENVIRONMENTAL ECONOMICS",
    "Subject": "ECON",
    "Number": 2125.0,
    "Description": "This course investigates the effect of human activity upon the environment as well as the effect of the environment on human well-being. It pays special attention to the impact of production and consumption of material goods upon the quantity and quality of environmental goods. The analysis focuses on the challenges presented in mixed economics where markets are combined with government intervention to manage pollution and scarcity. The course reviews efforts to measure the costs and benefits of improving environmental conditions and evaluates current and potential policies in terms of the costs of the environmental improvements they may yield. Attention is also paid to the special difficulties which arise when the impacts of pollution spill across traditional political boundaries.",
    "SDGs": []
  },
  {
    "Name": "THE GREEN ECONOMY AND MODELS FOR ALTERNATIVE FORMS OF DEVELOPMENT.",
    "Subject": "ENV",
    "Number": 1500.0,
    "Description": "This course examines the limitations of traditional economic models and charts a new course for current policies and practices. To chart this path we draw upon and synthesize examples from existing alternative economies (e.g., different forms of dematerialization, hybrid organizations, solidary economy, sharing economy).The course critically examines current paradigms of greening and seeks to expand thinking that will encompass new, alternative, and socially just conceptions of economy and economic development. A particular emphasis is laid on the spatial implications of de-growth oriented activities which partly challenge existing models and research methods in economic geography.",
    "SDGs": []
  },
  {
    "Name": "ENGINEERING INNOVATION AND ENTREPRENEURSHIP",
    "Subject": "ETR",
    "Number": 1100.0,
    "Description": "In the modern competitive and global world confronting today’s engineers, innovation and entrepreneurship (I&E) are increasingly important perspectives for every engineering career. Individuals proficient in I&E are likely to possess unique competitive advantage over those who do not. This course develops the foundation for developing such proficiency by examining the functional roles of the business/commercial aspects of engineering disciplines as well as establishing a basis for innovative thinking. Specific cases where I&E has led to new products innovation and new enterprise development will supplement course materials.",
    "SDGs": []
  },
  {
    "Name": "SOCIAL ENTREPRENEURSHIP",
    "Subject": "ETR",
    "Number": 2900.0,
    "Description": "This course will introduce students to the concept of social entrepreneurship and the ways in which social entrepreneurs are addressing complex social problems with their entrepreneurial ventures. Students will be exposed to the challenges and rewards of running a social enterprise. They will learn valuable business and entrepreneurial tools that can be applied to the design of sustainable social business models. Topics include social opportunity recognition and evaluation, business models in the social sector, social impact assessment, the double-bottom line, scalability of solutions, organizational forms and structures, and social venture financing.",
    "SDGs": []
  },
  {
    "Name": "SCIENCE-TECHNOLOGY POLICY",
    "Subject": "GOV",
    "Number": 2302.0,
    "Description": "This course is an examination of the relationship between science-technology and government. It reviews the history of public policy for science and technology, theories and opinions about the proper role of government and several current issues on the national political agenda. Examples of these issues include genetic engineering, the environment and engineering education. It also examines the formation of science policy, the politics of science and technology, the science bureaucracy, enduring controversies such as public participation in scientific debates, the most effective means for supporting research, and the regulation of technology. Throughout the course we will pay particular attention to the fundamental theme: the tension between government demands for accountability and the scientific community's commitment to autonomy and self-regulation.",
    "SDGs": []
  },
  {
    "Name": "TOPICS IN ENVIRONMENTAL HISTORY",
    "Subject": "HI",
    "Number": 3317.0,
    "Description": "In this seminar course, students will explore one aspect of U.S. or global environmental history in more depth. Topics vary each year but may include environmental thought, environmental reform movements, comparative environmental movements, natural disasters, the history of ecology, built environments, environmental justice, New England environmental history, or the environmental history of South Asia or another region of the world. The course will require substantial reading and writing.",
    "SDGs": []
  },
  {
    "Name": "TOPICS IN ASIAN HISTORY",
    "Subject": "HI",
    "Number": 3343.0,
    "Description": "This seminar course examines topics in the cultural, socio-economic, religious and political history of East Asia. Topics vary each year and may include the following: nationalism and the writing of history, travel and exploration narratives, cross-cultural contact, the role of religion and ideology in political history, development and the environment in Asia, film and history, and the place of minorities and women in Asian societies.",
    "SDGs": []
  },
  {
    "Name": "SOCIAL SCIENCE RESEARCH FOR THE IQP",
    "Subject": "ID",
    "Number": 2050.0,
    "Description": "This course is open to students accepted to off-campus IQP centers and programs. The course introduces students to research design, methods for social science research, and analysis. It also provides practice in specific research and field skills using the project topics students have selected in conjunction with sponsoring agencies. Students learn to develop social science hypotheses based upon literature reviews in their topic areas and apply concepts drawn from social psychology, anthropology, sociology, economics and other areas as appropriate. Students make presentations, write an organized project proposal, and develop a communication model for reporting their project findings.",
    "SDGs": []
  },
  {
    "Name": "TOPICS IN GLOBAL STUDIES",
    "Subject": "INTL",
    "Number": 2910.0,
    "Description": "This seminar course takes an interdisciplinary approach to historical and contemporary topics in global studies. Topics vary each year and may include international development, global inequality and justice, global public health, war and terrorism, international organizations and governance, humanitarianism and human rights, travel and tourism, the Anthropocene, climate change. No prior background is required. Especially appropriate for students interested in any of WPI’s global Project Centers.",
    "SDGs": []
  },
  {
    "Name": "DESIGN AND OPTIMIZATION OF THERMAL SYSTEMS",
    "Subject": "ME",
    "Number": 4422.0,
    "Description": "This course introduces students to design of small and large scale optimal thermal systems. The hardware associated with thermal systems includes fans, pumps, compressors, engines, expanders, turbines, heat and mass exchangers, and reactors, all interconnected with some form of conduits. Generally, the working substances are fluids. These types of systems appear in such industries as power generation, electric and gas utilities, refrigeration and cryogenics, air conditioning and heating, food, chemical, petroleum, and other process industries. This course is intended for mechanical engineering students, especially those seeking a concentration in Thermal-Fluids. Additionally, this course might be of interest to students in Aerospace Engineering and Chemical Engineering.",
    "SDGs": []
  },
  {
    "Name": "WORK SYSTEMS AND FACILITIES PLANNING",
    "Subject": "OIE",
    "Number": 3405.0,
    "Description": "This course covers the fundamentals of developing efficient layouts for production and service facilities. Methods analysis, work measurement, material handling and material flow analysis are also covered. Mathematical models and computer tools are used to assist decision-making.",
    "SDGs": [3, 5, 9, 12]
  },
  {
    "Name": "SOCIAL AND POLITICAL PHILOSOPHY",
    "Subject": "PY",
    "Number": 2713.0,
    "Description": "This course examines metaphysical and moral questions that philosophers have raised about social and political life. Among questions treated might be: What are the grounds, if any, of the obligation of a citizen to obey a sovereign? Are there basic principles of justice by which societies, institutions and practices are rightly evaluated? What is democracy, and how can we tell if an institution or practice is democratic? To what degree do economic institutions put limits on the realization of freedom, democracy and self-determination? Readings might include excerpts from the works of Plato, Hobbes, Locke, Rousseau and Marx, as well as numerous contemporary philosophers.",
    "SDGs": []
  },
  {
    "Name": "PHILOSOPHY AND THE ENVIRONMENT",
    "Subject": "PY",
    "Number": 2717.0,
    "Description": "This course will focus on the following questions: What is the scope of the current environmental crisis? What does this crisis reveal about the philosophical presuppositions and dominant values of our intellectual worldviews and social institutions? How can existing social theories help explain the environmental crisis? What implications does the crisis have for our sense of personal identity? What moral and spiritual resources can help us respond to it? Readings will be taken from contemporary and historical philosophers and naturalists.",
    "SDGs": []
  },
  {
    "Name": "TOPICS IN PHILOSOPHY",
    "Subject": "PY",
    "Number": 3711.0,
    "Description": "The purpose of this course is to expose students to somewhat more advanced and specialized study in philosophy. Its focus will vary, but will typically be one of the following types: a particular philosopher (e.g., Plato, Kant, Mill); a particular philosophical tradition (e.g., Pragmatism, Ordinary Language philosophy, Empiricism); a particular philosophical problem (free will, knowledge of other minds, historical explanation); or a particular philosophical classic (Hegel's Phenomenology of Mind, Aristotle's Ethics). The topical theme of the class will be provided as a modified course title in the course description posted online.",
    "SDGs": []
  },
  {
    "Name": "CORROSION AND CORROSION CONTROL",
    "Subject": "MTE",
    "Number": 5844.0,
    "Description": "An introductory course on corrosion; aqueous corrosion, stress corrosion cracking and hydrogen effects in metals will be presented. High Temperature oxidation, carburization and sulfidation will be discussed. Discussions focus on current corrosive engineering problems and research.",
    "SDGs": []
  }
]
